In [40]:
import pandas as pd

In [41]:
idades = [32, 38, 30, 30, 31, 35, 25, 29, 31, 37, 27, 23, 36, 33, 39]

In [42]:
nomes = ["Téo", "Maria", "João", "Ana", "Lucas", "Paula", "Pedro", "Lúcia", "Rafael", "Clara", "Bruno", "Sofia", "Miguel", "Laura", "Carol"]

In [43]:
series_idades = pd.Series(idades)
series_nomes = pd.Series(nomes)
series_nomes

0        Téo
1      Maria
2       João
3        Ana
4      Lucas
5      Paula
6      Pedro
7      Lúcia
8     Rafael
9      Clara
10     Bruno
11     Sofia
12    Miguel
13     Laura
14     Carol
dtype: object

In [44]:
df = pd.DataFrame()
df["idades"] = series_idades
df["nomes"] = series_nomes
df

    idades   nomes
0       32     Téo
1       38   Maria
2       30    João
3       30     Ana
4       31   Lucas
5       35   Paula
6       25   Pedro
7       29   Lúcia
8       31  Rafael
9       37   Clara
10      27   Bruno
11      23   Sofia
12      36  Miguel
13      33   Laura
14      39   Carol

In [45]:
df.iloc[8]["nomes"]

'Rafael'